src/cf/Catalogs/RMQ_Сообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>RMQ_Сообщения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТелоСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Exchange</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/Онбординг_RMQ/Ext/Module.bsl
Процедура ПроверитьПодключениеСервер(УникальныйИдентификатор,Сервер) экспорт
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер(УникальныйИдентификатор);
	ПроверитьПодключение(КлиентКомпоненты, Сервер);
	
КонецПроцедуры

Функция ПолучитьКомпонентуСервер(УникальныйИдентификатор) экспорт
	
	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпоненту(КлиентКомпоненты) Тогда
		
		ПодключитьКомпонентуСервер(УникальныйИдентификатор);
		ИнициализироватьКомпоненту(КлиентКомпоненты);
		
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
КонецФункции

Процедура ПодключитьКомпонентуСервер(УникальныйИдентификатор,КомпонентаПодключена = Неопределено)
	
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	//Сообщить(НСтр("ru = 'Компонента подключена!'"));
КонецПроцедуры

Функция ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор)
	
	МакетВнешнейКомпоненты    = ПолучитьОбщийМакет("RMQ");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

Функция ИнициализироватьКомпоненту(Компонента) экспорт
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ_9");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ПроверитьПодключение(КлиентКомпоненты, Сервер) Экспорт
	
	Попытка
		СоединитьсяССервером(КлиентКомпоненты,Сервер);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка подключения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить(НСтр("ru = 'Подключение успешно выполнено!'"));
	
КонецПроцедуры

Процедура ОтправитьСообщение(КлиентКомпоненты, Сервер, Exchange, Message) Экспорт
	
		СоединитьсяССервером(КлиентКомпоненты,Сервер);

		ТочкаОбмена = СокрЛП(Exchange.ТочкаОбмена);
		КлючМаршрутизации  = ?(ЗначениеЗаполнено(Exchange.КлючМаршрутизации),Exchange.КлючМаршрутизации,"#");
		МетодОтправитьСообщение(КлиентКомпоненты,ТочкаОбмена,КлючМаршрутизации,Message,1,Ложь);
	

КонецПроцедуры

Процедура СозданиеТочкиИОчереди(КлиентКомпоненты, Сервер, Exchange) Экспорт
	
	СоединитьсяССервером(КлиентКомпоненты,Сервер);
			
	ТочкаОбмена = СокрЛП(Exchange.ТочкаОбмена);
	ОбъявитьТочкуОбмена(КлиентКомпоненты,ТочкаОбмена,?(ЗначениеЗаполнено(Exchange.Тип),Exchange.Тип,Неопределено));
	ИмяОчереди  = СокрЛП(Exchange.ИмяОчереди);
	КлючМаршрутизации  = ?(ЗначениеЗаполнено(Exchange.КлючМаршрутизации),Exchange.КлючМаршрутизации,"#");
	ОбъявитьОчередь(КлиентКомпоненты,ИмяОчереди);
	УстановитьСвязьОчереди(КлиентКомпоненты, ИмяОчереди, ТочкаОбмена, КлючМаршрутизации);
	
КонецПроцедуры

Процедура УстановитьСвязиТочкиОбменаИОчереди(КлиентКомпоненты, Сервер, Exchange) Экспорт
	
	СоединитьсяССервером(КлиентКомпоненты,Сервер);
			
	ТочкаОбмена = СокрЛП(Exchange.ТочкаОбмена);
//	ОбъявитьТочкуОбмена(КлиентКомпоненты,ТочкаОбмена,?(ЗначениеЗаполнено(Exchange.Тип),Exchange.Тип,Неопределено),Истина);
	ИмяОчереди  = СокрЛП(Exchange.ИмяОчереди);
	КлючМаршрутизации  = ?(ЗначениеЗаполнено(Exchange.КлючМаршрутизации),Exchange.КлючМаршрутизации,"#");
//	ОбъявитьОчередь(КлиентКомпоненты,ИмяОчереди,Истина);
	УстановитьСвязьОчереди(КлиентКомпоненты, ИмяОчереди, ТочкаОбмена, КлючМаршрутизации);
	
КонецПроцедуры




Процедура СозданиеОчереди(КлиентКомпоненты, Сервер, Exchange) Экспорт
	
	СоединитьсяССервером(КлиентКомпоненты,Сервер);
	ТочкаОбмена = СокрЛП(Exchange.ТочкаОбмена);
	ИмяОчереди  = СокрЛП(Exchange.ИмяОчереди);
	ОбъявитьОчередь(КлиентКомпоненты,ИмяОчереди);
	КлючМаршрутизации  = ?(ЗначениеЗаполнено(Exchange.КлючМаршрутизации),Exchange.КлючМаршрутизации,"#");
	УстановитьСвязьОчереди(КлиентКомпоненты, ИмяОчереди, ТочкаОбмена, КлючМаршрутизации);
	
КонецПроцедуры

Процедура СозданиеТочки(КлиентКомпоненты, Сервер, Exchange) Экспорт
	
	СоединитьсяССервером(КлиентКомпоненты,Сервер);
	ТочкаОбмена = СокрЛП(Exchange.ТочкаОбмена);
	ОбъявитьТочкуОбмена(КлиентКомпоненты,ТочкаОбмена,?(ЗначениеЗаполнено(Exchange.Тип),Exchange.Тип,Неопределено));
	
КонецПроцедуры

Процедура ПрочитатьСообщениеИзОчереди(КлиентКомпоненты, Сервер, Exchange) Экспорт
	
	СоединитьсяССервером(КлиентКомпоненты,Сервер);
	ИмяОчереди  = Exchange.ИмяОчереди;
	
	Попытка
		ОбъявитьОчередь(КлиентКомпоненты,ИмяОчереди);
		Потребитель = ЗарегистрироватьПотребителя(КлиентКомпоненты,ИмяОчереди);
		ОтветноеСообщение = "";
        messageTag = 0;
		Если ПолучитьСообщение(КлиентКомпоненты,, ОтветноеСообщение, messageTag) Тогда
			ПодтвердитьПолучениеСообщение(КлиентКомпоненты, messageTag);
			Если СоздатьЗаписьВходящегоСообщения(ОтветноеСообщение,Exchange) тогда
				ТекстСообщения = НСтр("ru='Сообщение успешно прочитано и записано!'");
			Иначе
				ЗаписьЖурналаРегистрации("RMQ.ОшибкаЗаписиСообщения",УровеньЖурналаРегистрации.Ошибка,,ОтветноеСообщение,"Ошибка записи Сообщения");
				ТекстСообщения = НСтр("ru='Сообщение успешно прочитано!'");
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru='Очередь пустая!'");
		КонецЕсли;
		Сообщить(ТекстСообщения);
		ЗакрытьПотребителя(КлиентКомпоненты,Потребитель);
	Исключение
		ПолучитьИнформациюПоПоследнейОшибке(КлиентКомпоненты);
	КонецПопытки;
	
КонецПроцедуры

Функция СоздатьЗаписьВходящегоСообщения(Message,Exchange) Экспорт
	
	Результат = Ложь;
	Попытка
		НовоеСообщение = Справочники.RMQ_Сообщения.СоздатьЭлемент();
		НовоеСообщение.Наименование = Строка(Exchange) + " " + Строка(ТекущаяДата());
		НовоеСообщение.Exchange = Exchange;
		НовоеСообщение.ТелоСообщения = Новый ХранилищеЗначения(Message);
		НовоеСообщение.Записать();
		результат = Истина;
	Исключение
		ЗаписьЖурналаРегистрации("RMQ.ОшибкаЗаписиСообщения",УровеньЖурналаРегистрации.Ошибка,,Message,"Ошибка записи Сообщения");
	КонецПопытки;
	Возврат Результат;
	
КонецФункции

Процедура ОтвязатьОчередь(КлиентКомпоненты, Сервер, Exchange) Экспорт
	
	СоединитьсяССервером(КлиентКомпоненты,Сервер);
	ТочкаОбмена = СокрЛП(Exchange.ТочкаОбмена);
	ИмяОчереди  = СокрЛП(Exchange.ИмяОчереди);
	КлючМаршрутизации = ?(ЗначениеЗаполнено(Exchange.КлючМаршрутизации),Exchange.КлючМаршрутизации,"#");
	ОтсоединитьОчередьОтТочки(КлиентКомпоненты, ИмяОчереди, ТочкаОбмена, КлючМаршрутизации);
	
КонецПроцедуры

Процедура УдалитьОчередь(КлиентКомпоненты, Сервер, Exchange) Экспорт
	
	СоединитьсяССервером(КлиентКомпоненты,Сервер);
	ИмяОчереди  = СокрЛП(Exchange.ИмяОчереди);
	УдалитьОчередьССервера(КлиентКомпоненты, ИмяОчереди);
	
КонецПроцедуры

Процедура УдалитьТочку(КлиентКомпоненты, Сервер, Exchange) Экспорт
	
	СоединитьсяССервером(КлиентКомпоненты,Сервер);
	ТочкаОбмена = СокрЛП(Exchange.ТочкаОбмена);
	УдалитьТочкуОбмена(КлиентКомпоненты, ТочкаОбмена);
	
КонецПроцедуры


//Connect - устанавливает соединение с сервером RabbitMQ
//Параметры:
//КлиентКомпоненты - компонента
//host - Строка - Адрес сервера RabbitMQ
//port - Число - Порт работы через tcp (обычно 5672)
//login - Строка - Имя пользователя
//pwd - Строка - Пароль пользователя
//vhost - Строка - Vhost пользователя
//pingRate - Число - [НЕ РЕАЛИЗОВАНО][НЕОБЯЗАТЕЛЬНЫЙ]. Частота пульса
Процедура СоединитьсяССервером(КлиентКомпоненты,Сервер) Экспорт
	
	Попытка
		КлиентКомпоненты.Connect(
			Сервер.Адрес,
			Сервер.Порт,
			Сервер.Логин,
			Сервер.Пароль,
			Сервер.ВиртуальныйХост);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка подключения к " + Сервер + " !%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
			
Конецпроцедуры

//DeclareExchange - Объявить точку обмена
//Параметры:
//КлиентКомпоненты - компонента
//name - Строка - Имя exchange
//type - Строка - Тип точки обмена. Поддерживаются "direct", "fanout", "topic"
//onlyCheckIfExists - Булево - Не создавать новую, выбросить исключение, если такой точки нет.
//durable - Булево - Сохранять сообщения на диске на случай рестарта RMQ (не рекомендуется)
//autodelete - Булево - Удалить после того, как от точки будут отвязаны все очереди.
Процедура ОбъявитьТочкуОбмена(КлиентКомпоненты,Точкаобмена,ТипТочки = "topic",НеСоздаватьНовую = Ложь,Durable = Истина,Autodelete = ложь) Экспорт  
	
	Попытка	
		КлиентКомпоненты.DeclareExchange(ТочкаОбмена, ТипТочки, НеСоздаватьНовую, Durable, Autodelete);	
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка создания Exchange!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

//DeclareQueue - Объявить очередь
//Параметры:
//КлиентКомпоненты - компонента
//name - Строка - Имя объявляемой очереди.
//onlyCheckIfExists - Булево - Не создавать очередь с таким именем, использовать существующую
//save - Булево - Кешировать сообщения на диске, на случай падения RMQ.
//exclusive - Булево - [НЕ РЕАЛИЗОВАНО] Только текущее соединение может иметь доступ к этой очереди.
//autodelete - Булево - Удалить очередь если к ней был подключен, а затем отключен читающий клиент.
//Возвращаемое значение:
//Имя очереди, заданное явно в 1-м параметре.
Процедура ОбъявитьОчередь(КлиентКомпоненты,ИмяОчереди,НеСоздаватьНовую = Ложь,Save = Истина,Exclusive = Ложь,Autodelete = ложь) Экспорт  
	
	Попытка	
		КлиентКомпоненты.DeclareQueue(ИмяОчереди, НеСоздаватьНовую, Save, Exclusive, Autodelete);	
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка создания очереди " + ИмяОчереди + "!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;		
	
КонецПроцедуры

//BindQueue - Установить связь очереди. Создает маршрут от точки обмена до очереди.
//Параметры:
//КлиентКомпоненты - компонента
//queue - Строка - Имя очереди
//exchange - Строка - Имя точки обмена
//routingKey - Строка - Rлюч маршрутизации.
Процедура УстановитьСвязьОчереди(КлиентКомпоненты,queue,exchange,routingKey) Экспорт

	Попытка	
		КлиентКомпоненты.BindQueue(queue, exchange, routingKey);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка создания Связи очереди " + queue + " с Exchange " + exchange + "!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
КонецПроцедуры

//BasicPublish - Отправить сообщение
//Параметры:
//КлиентКомпоненты - компонента
//exchange - Строка - Имя точки в которую отправляется сообщение
//routingKey - Строка - Ключ маршрутизации (см. руководство RMQ)
//message - Строка - Тело сообщения
//livingTime - Число - [НЕ РЕАЛИЗОВАНО] Время жизни сообщения в миллисекундах
//persist - Булево - [НЕ РЕАЛИЗОВАНО] Сбрасывать сообщение на диск
Процедура МетодОтправитьСообщение(КлиентКомпоненты,exchange,routingKey,message,livingTime = 1,persist = Ложь) Экспорт
	
	Попытка
		КлиентКомпоненты.BasicPublish(
			exchange,
			routingKey,
			message,
			livingTime,
			persist);
		//Сообщить("Сообщение успешно отправлено!");

	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;

КонецПроцедуры

Функция ПолучитьПараметрыСервераRMQ() Экспорт
    Возврат Новый Структура("Адрес, Порт, Логин, Пароль, ВиртуальныйХост", Константы.RMQ_Хост.Получить(), 
    Константы.RMQ_Порт.Получить(), 
    Константы.RMQ_Пользователь.Получить(), 
    Константы.RMQ_Пароль.Получить(), 
    Константы.RMQ_VHost.Получить());
КонецФункции

// Для отправки одного/пакета Сообщений
//Функция ОтправитьПакетСообщений(КлиентКомпоненты, Пакет) Экспорт
//	Результат = Ложь;	
//	Если ТипЗнч(Пакет) = Тип("Массив") Тогда
//		Для Каждого Сообщение из Пакет Цикл
//			Exchange = Сообщение.Exchange;
//			ТочкаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Exchange,"ТочкаОбмена");
//			Сервер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Exchange,"Владелец");
//			Если НЕ (ЗначениеЗаполнено(Сервер) И ЗначениеЗаполнено(Exchange)) Тогда
//				ЗаписьЖурналаРегистрации("RMQ.Ошибка отправки сообщения",УровеньЖурналаРегистрации.Ошибка,,РегистрыСведений.oo_ОчередьОтправляемыхСообщений.Выбрать(,,Новый Структура("ИдентификаторСообщения",Сообщение.id)),"ошибка отправки сообщения: не указан exchange и сервер",);
//			Иначе
//				СоединитьсяССервером(КлиентКомпоненты,Сервер);
//				КлючМаршрутизации  = Сообщение.RoutingKey;
//				XMLКотправке = oo_ОбщегоНазначения.СформироватьСообщениеESB_HTTP(ФабрикаXDTO, Сообщение);
//			//	МетодОтправитьСообщение(КлиентКомпоненты,ТочкаОбмена,?(ЗначениеЗаполнено(КлючМаршрутизации),КлючМаршрутизации,"#"),Сообщение.body,1,Ложь);
//				МетодОтправитьСообщение(КлиентКомпоненты,ТочкаОбмена,?(ЗначениеЗаполнено(КлючМаршрутизации),КлючМаршрутизации,"#"),XMLКотправке,1,Ложь);
//				результат = истина;
//			КонецЕсли;
//		КонецЦикла;
//		результат = Истина;
//	Иначе
//		Exchange = Пакет.Exchange;
//		ТочкаОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Exchange,"ТочкаОбмена");
//		Сервер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Exchange,"Владелец");
//		Если НЕ (ЗначениеЗаполнено(Сервер) И ЗначениеЗаполнено(Exchange)) Тогда
//			ЗаписьЖурналаРегистрации("RMQ.Ошибка отправки сообщения",УровеньЖурналаРегистрации.Ошибка,,РегистрыСведений.oo_ОчередьОтправляемыхСообщений.Выбрать(,,Новый Структура("ИдентификаторСообщения",Пакет.id)),"ошибка отправки сообщения: не указан exchange и сервер",);
//		Иначе
//			СоединитьсяССервером(КлиентКомпоненты,Сервер);
//			КлючМаршрутизации  = Пакет.RoutingKey;
//			XMLКотправке = oo_ОбщегоНазначения.СформироватьСообщениеESB_HTTP(ФабрикаXDTO, Пакет);
////			МетодОтправитьСообщение(КлиентКомпоненты,ТочкаОбмена,?(ЗначениеЗаполнено(КлючМаршрутизации),КлючМаршрутизации,"#"),Пакет.body,1,Ложь);
//			МетодОтправитьСообщение(КлиентКомпоненты,ТочкаОбмена,?(ЗначениеЗаполнено(КлючМаршрутизации),КлючМаршрутизации,"#"),XMLКотправке,1,Ложь);
//			результат = истина;
//		КонецЕсли;
//	КонецЕсли;
//	Возврат результат;
//КонецФункции

//BasicConsume - Начать чтение. Регистрирует потребителя сообщений для очереди.
//Параметры:
//КлиентКомпоненты - компонента
//queue - Строка - Очередь из которой будем читать сообщения.
//consumerId - Строка - [НЕ РЕАЛИЗОВАНО] имя потребителя. Если не задан, то имя потребителя сгенерирует сервер и вернет из метода
//noConfirm - Булево - [НЕ РЕАЛИЗОВАНО] не ждать подтверждения обработки. Сообщения будут удалены из очереди сразу после отправки на клиента.
//exclusive - Булево - [НЕ РЕАЛИЗОВАНО] монопольно захватить очередь
//selectSize - Число - [НЕ РЕАЛИЗОВАНО] количество сообщений единовременно отправляемых клиенту. Оптимизационный параметр, если > 1 усложняет программирование клиента
//Возвращаемое значение:
//Строка. Имя потребителя, сгенерированное сервером или переданное в параметре ИмяПотребителя.
Функция ЗарегистрироватьПотребителя(КлиентКомпоненты,queue,consumerId = "",noConfirm = Истина,exclusive = ложь,selectSize = 0) Экспорт
	Потребитель = КлиентКомпоненты.BasicConsume(queue, consumerId, noConfirm, exclusive, selectSize);
	Возврат Потребитель;
КонецФункции

//BasicConsumeMessage - Получить сообщение
//Параметры:
//КлиентКомпоненты - компонента
//consumerId - Строка - [НЕ РЕАЛИЗОВАНО] Имя зарегистрированного потребителя
//outdata - Строка - Выходной параметр. Тело сообщения.
//timeout - Число - Таймаут ожидания сообщения в миллисекундах. 0 означает без ожидания
Функция ПолучитьСообщение(КлиентКомпоненты,consumerId = "",outdata, messageTag, timeout = 5) Экспорт
	Если КлиентКомпоненты.BasicConsumeMessage(consumerId,outdata, messageTag, timeout) Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
КонецФункции


//BasicAck Отсылает серверу подтверждение (ack), что сообщение обработано и его можно удалить. Подтвердить можно только последнее прочитанное сообщение.
//КлиентКомпоненты - компонента
//Параметры отсутствуют
Процедура ПодтвердитьПолучениеСообщение(КлиентКомпоненты, messageTag) Экспорт
	КлиентКомпоненты.BasicAck(messageTag)
КонецПроцедуры

//BasicCancel - Закрывает канал для чтения сообщений
//Параметры:
//КлиентКомпоненты - компонента
//channelId - Строка - Имя созданного ранее потребителя.
Процедура ЗакрытьПотребителя(КлиентКомпоненты,channelId = "") Экспорт
	КлиентКомпоненты.BasicCancel(channelId);
КонецПроцедуры

//GetLastError - получает информацию о последней ошибке
//Параметры отсутствуют
//КлиентКомпоненты - компонента
//Возвращаемое значение:
//Строка - Последнее сообщение ошибки
Процедура ПолучитьИнформациюПоПоследнейошибке(КлиентКомпоненты) Экспорт
	ИнфоПоОшибке = КлиентКомпоненты.GetLastError();
	ЗаписьЖурналаРегистрации("RMQ.ОшибкаПолученияСообщения",УровеньЖурналаРегистрации.Ошибка,,ИнфоПоОшибке,ИнфоПоОшибке);
КонецПроцедуры

//DeleteExchange - Удалить точку обмена
//Параметры:
//КлиентКомпоненты - компонента
//name - Строка- Имя точки обмена.
//ifunused - Булево - Удаление будет выполнено, только если точка обмена не используется.
Процедура УдалитьТочкуОбмена(КлиентКомпоненты,name,ifunused = Истина)
	КлиентКомпоненты.DeleteExchange(name,ifunused);	
КонецПроцедуры

//DeleteQueue - Удаляет очередь с сервера
//Параметры:
//КлиентКомпоненты - компонента
//name - Строка - Имя очереди
//onlyIfIdle - Булево - Удаление будет выполнено, только если очередь не используется
//onlyIfEmpty - Булево - Удаление будет выполнено, только если очередь пуста
Процедура УдалитьОчередьССервера(КлиентКомпоненты,name,onlyIfIdle = Истина,onlyIfEmpty = Истина)
	КлиентКомпоненты.DeleteQueue(name,onlyIfIdle,onlyIfEmpty);	
КонецПроцедуры

//UnbindQueue - Отсоединяет очередь от точки обмена.
//Параметры:
//КлиентКомпоненты - компонента
//queue - Строка - Имя очереди
//exchange - Строка - Имя точки обмена
//routingKey - Строка - Rлюч маршрутизации.
Процедура ОтсоединитьОчередьОтТочки(КлиентКомпоненты,queue,exchange,routingKey)
	КлиентКомпоненты.UnbindQueue(queue,exchange,routingKey);
КонецПроцедуры
